[
{
    "model": "CORE.compilancetype",
    "pk": 1,
    "fields": {
        "name": "CERT-In Security Audit"
    }
},
{
    "model": "CORE.compilancetype",
    "pk": 2,
    "fields": {
        "name": "NIC Safe-to-Host"
    }
},
{
    "model": "CORE.compilancetype",
    "pk": 3,
    "fields": {
        "name": "RBI Cyber Security Framework"
    }
},
{
    "model": "CORE.compilancetype",
    "pk": 4,
    "fields": {
        "name": "RBI SAR (System Audit Report)"
    }
},
{
    "model": "CORE.compilancetype",
    "pk": 5,
    "fields": {
        "name": "UIDAI (Aadhaar) AUA/KUA"
    }
},
{
    "model": "CORE.compilancetype",
    "pk": 6,
    "fields": {
        "name": "SEBI Cyber Security & Resilience"
    }
},
{
    "model": "CORE.compilancetype",
    "pk": 7,
    "fields": {
        "name": "ISO 27001:2022"
    }
},
{
    "model": "CORE.compilancetype",
    "pk": 8,
    "fields": {
        "name": "PCI DSS 4.0"
    }
},
{
    "model": "CORE.compilancetype",
    "pk": 9,
    "fields": {
        "name": "OWASP Top 10"
    }
},
{
    "model": "CORE.compilancetype",
    "pk": 10,
    "fields": {
        "name": "SOC 2 Type II"
    }
},
{
    "model": "CORE.compilancetype",
    "pk": 11,
    "fields": {
        "name": "DPDP Act 2023"
    }
},
{
    "model": "CORE.compilancetype",
    "pk": 12,
    "fields": {
        "name": "GDPR"
    }
},
{
    "model": "CORE.assessmenttype",
    "pk": 1,
    "fields": {
        "name": "Web"
    }
},
{
    "model": "CORE.assessmenttype",
    "pk": 2,
    "fields": {
        "name": "Mobile"
    }
},
{
    "model": "CORE.assessmenttype",
    "pk": 3,
    "fields": {
        "name": "Network"
    }
},
{
    "model": "CORE.assessmenttype",
    "pk": 4,
    "fields": {
        "name": "API"
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 1,
    "fields": {
        "name": "Broken Access Control",
        "description": "Cross-Site Scripting allows attackers to inject malicious scripts into web pages viewed by other users.",
        "remediations": "Can lead to theft of sensitive information, session hijacking, etc.",
        "impact": "Can lead to theft of sensitive information, session hijacking, etc.",
        "reference": "https://owasp.org/www-community/attacks/xss/",
        "cvss": "",
        "category_of_testing": 1
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 2,
    "fields": {
        "name": "Cryptographic Failures",
        "description": "A weak password policy allows users to set easily guessable passwords, increasing the risk of unauthorized access.",
        "remediations": "Potential compromise of user accounts.",
        "impact": "Enforce strong password policies, implement multi-factor authentication.",
        "reference": "https://owasp.org/www-project-web-security-testing-guide/latest/4-Web_Application_Security_Testing/04-Authentication_Testing/07-Testing_for_Weak_Password_Policy",
        "cvss": "",
        "category_of_testing": 1
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 3,
    "fields": {
        "name": "Injection",
        "description": "Remote Code Execution allows attackers to execute arbitrary code on the affected system remotely.",
        "remediations": "Keep software and frameworks updated, apply security patches regularly.",
        "impact": "Complete compromise of the system, potential for unauthorized access.",
        "reference": "https://owasp.org/www-project-web-security-testing-guide/latest/4-Web_Application_Security_Testing/04-Authentication_Testing/07-Testing_for_Weak_Password_Policy",
        "cvss": "",
        "category_of_testing": 1
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 4,
    "fields": {
        "name": "Insecure Design",
        "description": "SPF (Sender Policy Framework) and DMARC (Domain-based Message Authentication, Reporting, and Conformance) records are missing when a domain lacks these email authentication protocols. SPF helps prevent email spoofing, and DMARC adds an additional layer of protection by specifying how to handle emails that fail SPF or DKIM (DomainKeys Identified Mail) checks.",
        "remediations": "To mitigate the risk, organizations should configure SPF records to specify authorized mail servers and implement DMARC to provide guidance on email authentication policies. Regularly monitor and update these records to enhance email security. The correct setup of SPF and DMARC records helps prevent email-based attacks and ensures a more secure email communication environment.",
        "impact": "The absence of SPF and DMARC records increases the risk of email spoofing, phishing attacks, and unauthorized use of a domain in malicious activities. This could harm a company's reputation, compromise sensitive information, and lead to recipients receiving fraudulent emails that appear legitimate.",
        "reference": "https://dmarc.org/",
        "cvss": "",
        "category_of_testing": 1
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 5,
    "fields": {
        "name": "Security Misconfiguration",
        "description": "Input Validation Missing occurs when a system does not adequately validate or sanitize user inputs. This oversight can lead to vulnerabilities such as injection attacks, where malicious input is injected into the system, potentially compromising its integrity and security. This vulnerability is present throughout the application have same source code.",
        "remediations": "To address Input Validation Missing issues, organizations should implement robust input validation mechanisms. This involves validating and sanitizing user inputs to ensure they meet expected criteria, minimizing the risk of injection attacks. Developers should use parameterized queries, input validation libraries, and other secure coding practices to strengthen the overall security of the system. Regular code reviews and security testing can help identify and rectify instances where input validation is lacking.",
        "impact": "The absence of input validation opens the door for various attacks, including SQL injection, cross-site scripting (XSS), and command injection. Attackers can exploit these vulnerabilities to manipulate or inject malicious code, leading to unauthorized access, data breaches, or the compromise of the entire system.",
        "reference": "https://owasp.org/www-community/vulnerabilities/Improper_Data_Validation",
        "cvss": "",
        "category_of_testing": 1
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 6,
    "fields": {
        "name": "Broken Object Level Authorization (BOLA)",
        "description": "Concurrent sessions allowed vulnerability is a security weakness that arises when an application or system allows a single user to have multiple active sessions at the same time. When a user is allowed to have multiple active sessions, it becomes easier for attackers to hijack the user's sessions and gain unauthorized access to their account. For example, an attacker may be able to use a stolen session ID or cookie to impersonate the user and access their account without requiring the user's login credentials.",
        "remediations": "Concurrent sessions allowed vulnerability can be mitigated by implementing session management controls, such as limiting the number of active sessions that a user can have at the same time or requiring users to log out of one session before logging into another. Implementing session timeout controls, which automatically log users out of their sessions after a set period of inactivity, can also help reduce the risk of concurrent session vulnerabilities.",
        "impact": "This vulnerability can be exploited by attackers to take over user accounts, compromise sensitive data, or cause system disruptions.",
        "reference": "https://cheatsheetseries.owasp.org/cheatsheets/Session_Management_Cheat_Sheet.html",
        "cvss": "",
        "category_of_testing": 4
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 7,
    "fields": {
        "name": "Broken Authentication",
        "description": "Concurrent sessions allowed vulnerability is a security weakness that arises when an application or system allows a single user to have multiple active sessions at the same time. When a user is allowed to have multiple active sessions, it becomes easier for attackers to hijack the user's sessions and gain unauthorized access to their account. For example, an attacker may be able to use a stolen session ID or cookie to impersonate the user and access their account without requiring the user's login credentials.",
        "remediations": "Concurrent sessions allowed vulnerability is a security weakness that arises when an application or system allows a single user to have multiple active sessions at the same time. When a user is allowed to have multiple active sessions, it becomes easier for attackers to hijack the user's sessions and gain unauthorized access to their account. For example, an attacker may be able to use a stolen session ID or cookie to impersonate the user and access their account without requiring the user's login credentials.",
        "impact": "This vulnerability can be exploited by attackers to take over user accounts, compromise sensitive data, or cause system disruptions.",
        "reference": "https://cheatsheetseries.owasp.org/cheatsheets/Session_Management_Cheat_Sheet.html",
        "cvss": "",
        "category_of_testing": 4
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 8,
    "fields": {
        "name": "Broken Object Property Level Authorization",
        "description": "Input Validation Missing occurs when a system does not adequately validate or sanitize user inputs. This oversight can lead to vulnerabilities such as injection attacks, where malicious input is injected into the system, potentially compromising its integrity and security. This vulnerability is present throughout the application have same source code.",
        "remediations": "",
        "impact": "The absence of input validation opens the door for various attacks, including SQL injection, cross-site scripting (XSS), and command injection. Attackers can exploit these vulnerabilities to manipulate or inject malicious code, leading to unauthorized access, data breaches, or the compromise of the entire system.",
        "reference": "https://owasp.org/www-community/vulnerabilities/Improper_Data_Validation",
        "cvss": null,
        "category_of_testing": 4
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 9,
    "fields": {
        "name": "Unrestricted Resource Consumption",
        "description": "Concurrent sessions allowed vulnerability is a security weakness that arises when an application or system allows a single user to have multiple active sessions at the same time. When a user is allowed to have multiple active sessions, it becomes easier for attackers to hijack the user's sessions and gain unauthorized access to their account. For example, an attacker may be able to use a stolen session ID or cookie to impersonate the user and access their account without requiring the user's login credentials.",
        "remediations": "",
        "impact": "This vulnerability can be exploited by attackers to take over user accounts, compromise sensitive data, or cause system disruptions.",
        "reference": "https://cheatsheetseries.owasp.org/cheatsheets/Session_Management_Cheat_Sheet.html",
        "cvss": null,
        "category_of_testing": 4
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 10,
    "fields": {
        "name": "Broken Function Level Authorization",
        "description": "We identified the target web site is using libraries detected that it is out of date.",
        "remediations": "",
        "impact": "Since this is an old version of the software, it may be vulnerable to attacks.",
        "reference": "https://owasp.org/www-project-top-ten/2017/A9_2017-Using_Components_with_Known_Vulnerabilities",
        "cvss": null,
        "category_of_testing": 4
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 11,
    "fields": {
        "name": "Unpatched Software/Firmware",
        "description": "Broken access control occurs when an application improperly restricts user permissions, allowing unauthorized access to data or functions.",
        "remediations": "",
        "impact": "This can lead to unauthorized actions such as viewing, modifying, or deleting data, compromising sensitive information, and violating privacy and security policies.",
        "reference": "https://owasp.org/Top10/A01_2021-Broken_Access_Control/",
        "cvss": null,
        "category_of_testing": 3
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 12,
    "fields": {
        "name": "Weak or Default Credentials",
        "description": "Sensitive data disclosure occurs when confidential information such as personal data, financial details, or login credentials is inadvertently exposed.",
        "remediations": "",
        "impact": "This can lead to identity theft, financial loss, legal consequences, and damage to an organization's reputation. Attackers can exploit the disclosed information for malicious activities.",
        "reference": "https://owasp.org/www-project-top-ten/2017/A3_2017-Sensitive_Data_Exposure",
        "cvss": null,
        "category_of_testing": 3
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 13,
    "fields": {
        "name": "Misconfigured Firewalls/Open Ports",
        "description": "A sensitive vulnerability in the Google Maps API disclosure refers to a security weakness that allows unauthorized access to sensitive location-based data and information exposed through the Google Maps API service. Such vulnerabilities can take various forms, including improper configuration settings, inadequate access controls, or software bugs that may inadvertently expose location data to unauthorized parties. Attackers who exploit these vulnerabilities gain access to sensitive information, potentially compromising user privacy, business operations, and data security.",
        "remediations": "",
        "impact": "1.\tData Exposure: Attackers can gain access to sensitive location data, which may include user locations, geospatial information, addresses, and routes. This exposes individuals and organizations to potential privacy violations and misuse of their location information.\n2.\tLocation Tracking: Unauthorized access to location data enables malicious actors to track the movements and activities of individuals or vehicles, posing significant risks to personal safety and privacy.\n3.\tBusiness Intelligence: Businesses and organizations that rely on the Google Maps API may have sensitive location-based data exposed. This can lead to competitive disadvantages, data leaks, or legal and regulatory consequences.\n4.\tUser Trust: Instances of data exposure erode user trust in the service and the organizations that use it, potentially resulting in reputational damage and decreased user confidence.",
        "reference": "https://owasp.org/www-project-top-ten/2017/A3_2017-Sensitive_Data_Exposure",
        "cvss": null,
        "category_of_testing": 3
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 14,
    "fields": {
        "name": "Man-in-the-Middle (MitM) Attacks",
        "description": "Account takeover occurs when an attacker gains unauthorized access to a user's account, typically through phishing, credential stuffing, or exploiting weak security measures.",
        "remediations": "",
        "impact": "This can lead to unauthorized transactions, data theft, identity fraud, and further exploitation of compromised accounts, significantly harming both users and the organization.",
        "reference": "https://owasp.org/Top10/A07_2021-Identification_and_Authentication_Failures/",
        "cvss": null,
        "category_of_testing": 3
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 15,
    "fields": {
        "name": "Lack of Network Segmentation",
        "description": "When users are required to create new passwords, password history reinforcement prevents them from reusing any passwords they've previously used, The system typically stores a history of previous passwords (usually hashed or encrypted for security) associated with each user account, When a user attempts to change their password, the system checks against this history to ensure the new password is not identical or similar to any of the previous ones.",
        "remediations": "",
        "impact": "1. Improved Security: Preventing password reuse reduces the likelihood of attackers gaining unauthorized access by guessing or using previously compromised passwords.\n2. Forced Creativity: Users are compelled to come up with new and unique passwords, which can improve overall password strength.\n3. User Frustration: Some users may find it challenging to constantly generate new passwords, especially if they have to change them frequently.",
        "reference": "https://owasp.org/www-project-web-security-testing-guide/latest/4-Web_Application_Security_Testing/04-Authentication_Testing/07-Testing_for_Weak_Password_Policy",
        "cvss": null,
        "category_of_testing": 3
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 16,
    "fields": {
        "name": "Improper Credential Usage",
        "description": "JWTs consist of three parts: a header, a payload, and a signature. The payload contains the claims, which are statements about an entity (typically the user) and additional data. Sensitive data such as user identifiers, access permissions, or session tokens may be included in the payload.",
        "remediations": "",
        "impact": "Storing sensitive data in JWTs without proper encryption or protection can lead to several security risks:\n1. Information Exposure: If an attacker gains access to a JWT, they can extract and decode the payload to obtain sensitive information about users, such as their identity, privileges, or personal data.\n2. Data Tampering: Since JWTs are signed but not encrypted by default, attackers can potentially modify the payload data if they can access or intercept the token. This could result in unauthorized access, privilege escalation, or data manipulation.\n3. Session Hijacking: If JWTs are used for session management, compromising a JWT allows an attacker to impersonate the user and perform actions on their behalf, leading to account takeover or unauthorized transactions.",
        "reference": "https://owasp.org/www-project-top-ten/2017/A3_2017-Sensitive_Data_Exposure",
        "cvss": null,
        "category_of_testing": 2
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 17,
    "fields": {
        "name": "Inadequate Supply Chain Security",
        "description": "Using POST parameters as GET parameters can pose a security vulnerability if the parameters contain sensitive information such as authentication tokens, passwords, or personal data. In the case of the specific example you provided, the vulnerability description, impact, and remediation are unlikely to be sensitive information, but it is still important to sanitize and validate these parameters to prevent injection attacks.",
        "remediations": "",
        "impact": "The impact parameter is included in the URL as a GET parameter, an attacker could potentially modify it to falsely inflate the severity of a reported vulnerability. For example, if the impact is normally rated as \"Low,\" an attacker could modify the URL to make it appear as \"Critical.\" This could lead to unnecessary panic, waste of resources, or delay in fixing actual high-severity vulnerabilities.",
        "reference": "https://owasp.org/www-project-web-security-testing-guide/latest/4-Web_Application_Security_Testing/02-Configuration_and_Deployment_Management_Testing/06-Test_HTTP_Methods",
        "cvss": null,
        "category_of_testing": 2
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 18,
    "fields": {
        "name": "Insecure Authentication/Authorization",
        "description": "Improper Error Handling involves mishandling errors in an application, leading to the disclosure of sensitive information or providing attackers with insights into the system's architecture or vulnerabilities.",
        "remediations": "",
        "impact": "Improper error handling can expose sensitive data, such as database errors or stack traces, to users or attackers. This information can be leveraged to launch further attacks, such as SQL injection or directory traversal.",
        "reference": "https://owasp.org/www-community/Improper_Error_Handling",
        "cvss": null,
        "category_of_testing": 2
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 19,
    "fields": {
        "name": "Insufficient Input/Output Validation",
        "description": "Using POST parameters as GET parameters can pose a security vulnerability if the parameters contain sensitive information such as authentication tokens, passwords, or personal data. In the case of the specific example you provided, the vulnerability description, impact, and remediation are unlikely to be sensitive information, but it is still important to sanitize and validate these parameters to prevent injection attacks.",
        "remediations": "",
        "impact": "The impact parameter is included in the URL as a GET parameter, an attacker could potentially modify it to falsely inflate the severity of a reported vulnerability. For example, if the impact is normally rated as \"Low,\" an attacker could modify the URL to make it appear as \"Critical.\" This could lead to unnecessary panic, waste of resources, or delay in fixing actual high-severity vulnerabilities.",
        "reference": "https://owasp.org/www-project-web-security-testing-guide/latest/4-Web_Application_Security_Testing/02-Configuration_and_Deployment_Management_Testing/06-Test_HTTP_Methods",
        "cvss": null,
        "category_of_testing": 2
    }
},
{
    "model": "CORE.vulnerabilities",
    "pk": 21,
    "fields": {
        "name": "Insecure Communication",
        "description": "URL Redirection occurs when a web application redirects users to a different URL, typically specified by a parameter or input, without proper validation.",
        "remediations": "",
        "impact": "URL Redirection can be exploited by attackers to trick users into visiting malicious websites, leading to phishing attacks, malware downloads, or theft of sensitive information. It can also facilitate open redirection attacks, allowing attackers to bypass security controls and perform unauthorized actions.",
        "reference": "https://owasp.org/www-project-web-security-testing-guide/v41/4-Web_Application_Security_Testing/11-Client_Side_Testing/04-Testing_for_Client_Side_URL_Redirect",
        "cvss": null,
        "category_of_testing": 2
    }
},
{
    "model": "CORE.teamsmanagement",
    "pk": 1,
    "fields": {
        "team_name": "Security"
    }
},
{
    "model": "CORE.teamsmanagement",
    "pk": 2,
    "fields": {
        "team_name": "IT"
    }
},
{
    "model": "CORE.teamsmanagement",
    "pk": 3,
    "fields": {
        "team_name": "Human Resource"
    }
},
{
    "model": "CORE.teamsmanagement",
    "pk": 4,
    "fields": {
        "team_name": "SDE"
    }
},
{
    "model": "CORE.teamsmanagement",
    "pk": 5,
    "fields": {
        "team_name": "SRE"
    }
},
{
    "model": "CORE.user",
    "pk": 1,
    "fields": {
        "password": "pbkdf2_sha256$1000000$u6Yvid38wdWZW9OkWfdNUI$vUqT5WOx6G/7eAEgg5BSa8B0OC+7DDwuEbACwvBsBjY=",
        "last_login": null,
        "is_superuser": true,
        "first_name": "Shivangi",
        "last_name": "Keshri",
        "email": "shivangikeshri21@gmail.com",
        "contact_number": null,
        "designation": null,
        "team": null,
        "is_staff": true,
        "is_active": true,
        "date_joined": "2025-12-07T11:09:47.311Z",
        "groups": [],
        "user_permissions": []
    }
},
{
    "model": "CORE.user",
    "pk": 2,
    "fields": {
        "password": "pbkdf2_sha256$1000000$7ZLbxFz1BKYPwhiqx0S9hW$1K8z3riCQ6mgOzSukRcmEDjcKFJ8Owy+/leoKPWF+1c=",
        "last_login": null,
        "is_superuser": false,
        "first_name": "Tester",
        "last_name": "1",
        "email": "tester1@gmail.com",
        "contact_number": "6712612712",
        "designation": "pentester",
        "team": 1,
        "is_staff": false,
        "is_active": true,
        "date_joined": "2025-12-07T11:34:40.711Z",
        "groups": [],
        "user_permissions": []
    }
},
{
    "model": "CORE.user",
    "pk": 3,
    "fields": {
        "password": "pbkdf2_sha256$1000000$pYBdyXRTPe1yuTCV0TCSp4$I3JXvWm2ddvf1HPWNDY+f/tY4Mpq71lP6Zhpw6kW2Uw=",
        "last_login": null,
        "is_superuser": false,
        "first_name": "Tester",
        "last_name": "2",
        "email": "tester2@gmail.com",
        "contact_number": "9126112712",
        "designation": "pentester",
        "team": 2,
        "is_staff": false,
        "is_active": true,
        "date_joined": "2025-12-07T11:35:12.466Z",
        "groups": [],
        "user_permissions": []
    }
},
{
    "model": "CORE.user",
    "pk": 4,
    "fields": {
        "password": "pbkdf2_sha256$1000000$EyHRrAcYk53bGcv6a7gQq3$hw1yp/f9ECdRKIWDxBXEeNrRuNdSiQTbfL2Mm+zaI+8=",
        "last_login": null,
        "is_superuser": false,
        "first_name": "Tester",
        "last_name": "3",
        "email": "tester3@gmail.com",
        "contact_number": "8766112712",
        "designation": "Software Developer",
        "team": 4,
        "is_staff": false,
        "is_active": true,
        "date_joined": "2025-12-07T11:35:43.509Z",
        "groups": [],
        "user_permissions": []
    }
},
{
    "model": "CORE.user",
    "pk": 5,
    "fields": {
        "password": "pbkdf2_sha256$1000000$Fc7PhAd13pspzUR1bnT8Xf$x2vGO8QSjjbyqjctb7Ks4CXyks3E7ieabAr6A0GMpt4=",
        "last_login": null,
        "is_superuser": false,
        "first_name": "Tester",
        "last_name": "4",
        "email": "tester4@gmail.com",
        "contact_number": "8768910712",
        "designation": "Software Developer",
        "team": 2,
        "is_staff": false,
        "is_active": true,
        "date_joined": "2025-12-07T11:37:41.516Z",
        "groups": [],
        "user_permissions": []
    }
}
]
